---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatError
source: html/16a03e7a-6b13-b2d6-7095-d56147ac6711.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatError Property

The resulting angle between the segments is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId SegmentsAngleTooGreatError { get; }
```